---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyFloatArray
source: html/8c042dcb-b778-6053-b500-1b8d5a943a4a.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyFloatArray

Represents a property consisting of an array of float values.

## Syntax (C#)
```csharp
public class AssetPropertyFloatArray : AssetProperty
```

## Remarks
In virtually all cases, the array will contain exactly 3 values.